OdIfcUnitConverter.clearUnits
\details
Removes all convertible units.

OdIfcUnitConverter.getConversionUnitName(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets name and prefix of convertion type.
\param unitType [in] A string that contains the type of the unit to be returned.
\param unitName [out] A unit name.
\param unitPrefix [out] A unit prefix name. If no prefix then the value is empty.
\returns True if the attributes are retrieved successfully, false otherwise.

OdIfcUnitConverter.appendUnit(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Appends a new convertible unit.
\param unitId [in] An identifier of the corresponding IfcConversionBasedUnit object.

OdIfcUnitConverter.appendUnit(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Appends a new convertible unit.
\param unitType [in] A string that contains the type of the convertible unit.
\param unitId   [in] An identifier of the corresponding IfcConversionBasedUnit object.
\remarks
The unit type value must belong to the IfcUnitEnum of the current schema.

OdIfcUnitConverter.convertToSIUnit(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Performs an attempt to convert a specified unit to the SI unit.
\param unitType [in] A string that contains the type of the unit to be converted.
\param val      [in] A unit value.
\returns A double value that contains the converted value of the specified unit type.
\remarks
The unit type value must belong to the IfcUnitEnum of the current schema.

OdIfcUnitConverter
\details
A class that implements conversion of different units to the SI units.